In [75]:
import pandas as pd
import numpy as np

In [76]:
accounts=pd.read_csv('data/twm_accounts.csv')
accounts.head()

  acct_nbr;cust_id;acct_type;account_active;acct_start_date;acct_end_date;starting_balance;ending_balance
0  13628063;1362806;SV  ;Y ;10.12.1995;NULL;1430....
1  4561143213627090;1362709;CC  ;Y ;15.3.1993;NUL...
2  4561143213628360;1362836;CC  ;Y ;18.3.1992;NUL...
3  13633112;1363311;CK  ;Y ;6.7.1995;NULL;11017.1...
4  4561143213633610;1363361;CC  ;Y ;17.6.1994;NUL...

In [77]:
raw_col_name=accounts.columns[0]
clean_col_names=raw_col_name.split(';')

In [78]:
accounts[clean_col_names] = accounts[raw_col_name].str.split(';', expand=True)

In [79]:
accounts.drop(raw_col_name, axis=1)

,acct_nbr,cust_id,acct_type,account_active,acct_start_date,acct_end_date,starting_balance,ending_balance
0,13628063,1362806,SV,Y,10.12.1995,NULL,1430.22,284.58
1,4561143213627090,1362709,CC,Y,15.3.1993,NULL,266.34,496.15
2,4561143213628360,1362836,CC,Y,18.3.1992,NULL,55.90,1000.00
3,13633112,1363311,CK,Y,6.7.1995,NULL,11017.13,968.46
4,4561143213633610,1363361,CC,Y,17.6.1994,NULL,849.37,462.28
...,...,...,...,...,...,...,...,...
1404,4561143213625560,1362556,CC,N,20.1.1992,19.8.1995,1433.94,20.00
1405,4561143213626240,1362624,CC,Y,29.11.1990,NULL,632.75,1400.00
1406,4561143213628750,1362875,CC,Y,24.2.1989,NULL,2810.91,3000.00
1407,13626543,1362654,SV,Y,17.10.1992,NULL,784.53,622.46
1408,13627032,1362703,CK,Y,18.9.1994,NULL,3649.18,107.33

In [80]:
customer=pd.read_csv('data/twm_customer.csv')
customer

    cust_id;income;age;years_with_bank;nbr_children;gender;marital_status;name_prefix;first_name;last_name;street_nbr;street_name;postal_code;city_name;state_code
0    1362691;26150;46;5;1;M ;2;        ;Donald     ...
1    1362487;6605;71;1;0;M ;2;        ;ChingDyi    ...
2    1363160;18548;38;8;0;F ;1;        ;Rosa       ...
3    1362752;47668;54;3;0;F ;1;        ;Lisa       ...
4    1362548;44554;59;9;2;F ;4;        ;Barbara    ...
..                                                 ...
742  1363324;14795;36;6;1;F ;4;        ;Lillian    ...
743  1362895;26387;56;6;1;M ;2;        ;Marty      ...
744  1362569;61300;50;0;2;M ;2;        ;Ken        ...
745  1363364;15100;37;7;0;F ;2;        ;Debbie     ...
746  1363303;17875;18;3;0;F ;1;        ;Molly      ...

[747 rows x 1 columns]